Тестовая_база_ERP_14/src/Reports/АнализСостоянияНалоговогоУчетаПоНалогуНаПрибыль/АнализСостоянияНалоговогоУчетаПоНалогуНаПрибыль.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>АнализСостоянияНалоговогоУчетаПоНалогуНаПрибыль</name>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СохраняемыеРеквизиты</name>
  </attributes>
  <attributes>
    <name>ВключатьОбособленныеПодразделения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияРасшифровки</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяРасшифровки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Report>

Тестовая_база_ERP_14/src/Reports/АнализСостоянияНалоговогоУчетаПоНалогуНаПрибыль/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Проверки = Новый Структура;
	Проверки.Вставить("КорректностьПериода", Истина);
	
	БухгалтерскиеОтчетыВызовСервера.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, Проверки);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КонецПериода) Тогда
		
		ОписаниеНалоговогоПериодаНачало = НалоговыйУчет.БлижайшийНалоговыйПериод(НачалоПериода, Организация);
		ОписаниеНалоговогоПериодаКонец  = НалоговыйУчет.БлижайшийНалоговыйПериод(КонецПериода,  Организация);
		
		Если ОписаниеНалоговогоПериодаНачало.Период <> ОписаниеНалоговогоПериодаКонец.Период Тогда
			
			ТекстСообщения = НСтр("ru = 'Укажите даты начала и окончания в пределах одного налогового периода (года)';
									|en = 'Specify start and end dates within one fiscal period (year)'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Отчет.НачалоПериода",, Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
		
	Если ИмяРасшифровки = "Схема0" И НЕ ВключатьОбособленныеПодразделения Тогда		
		СписокОП = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьСписокОбособленныхПодразделений(Организация);
		
		Если СписокОП.Количество() > 1 Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для расшифровки блока ""Налог"" выберите в поле ""Организация""
				|значение ""%1 с обособленными подразделениями"".';
				|en = 'To explain the ""Tax"" section, select the ""%1 with branch offices"" value
				|in the ""Company"" field. '"),
				Строка(ОбщегоНазначенияБПВызовСервераПовтИсп.ГоловнаяОрганизация(Организация)));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ПолеОрганизация",, Отказ);			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
